embeddedci-com/examples/scenario-sensors-stm32/main.c
static int usart1_read_byte_nonblocking(uint8_t *byte)
{
    if (rx_ring_tail == rx_ring_head)
    {
        return 0;                      /* ring empty */
    }
    *byte = rx_ring[rx_ring_tail];
    rx_ring_tail = (uint16_t)((rx_ring_tail + 1U) % RX_RING_SIZE);
    return 1;
}

static void uart_process_rx_byte(uint8_t byte)
{
    rx_byte_count++;

    if (byte == '\r')
    {
        rx_last_was_cr = 1U;
        printf("\r\n");
        if (cmd_index > 0U)
        {
            cmd_buffer[cmd_index] = '\0';
            cmd_ready = 1;
        }
        else
        {
            print_prompt();
        }
    }
    else if (byte == '\n')
    {
        if (rx_last_was_cr)
        {
            rx_last_was_cr = 0U;
            return;
        }
        printf("\r\n");
        if (cmd_index > 0U)
        {
            cmd_buffer[cmd_index] = '\0';
            cmd_ready = 1;
        }
        else
        {
            print_prompt();
        }
    }
    else if (byte == '\b' || byte == 0x7FU)
    {
        if (cmd_index > 0U)
        {
            cmd_index--;
            cmd_buffer[cmd_index] = '\0';
            printf("\b \b");
            (void)fflush(stdout);
        }
    }
    else if (byte >= 32U && byte <= 126U)
    {
        rx_last_was_cr = 0U;
        if (cmd_index < (CMD_BUF_SIZE - 1U))
        {
            cmd_buffer[cmd_index++] = (char)byte;
            printf("%c", (char)byte);
            (void)fflush(stdout);
        }
    }
}

static void process_command(char *cmd)
{
    command_count++;

    if (strcmp(cmd, "help") == 0)
    {
        print_help();
    }
    else if (strcmp(cmd, "status") == 0)
    {
        print_status();
    }
    else if (strcmp(cmd, "rotors on") == 0 || strcmp(cmd, "pc10pc11 on") == 0)
    {
        set_rotors(GPIO_PIN_SET);
        printf("ROTORS=ON (PC10=ON, PC11=ON)\r\n");
    }
    else if (strcmp(cmd, "rotors off") == 0 || strcmp(cmd, "pc10pc11 off") == 0)
    {
        set_rotors(GPIO_PIN_RESET);
        printf("ROTORS=OFF (PC10=OFF, PC11=OFF)\r\n");
    }
    else if (strcmp(cmd, "monitor i2c") == 0)
    {
        monitor_i2c_until_key();
    }
    else if (strcmp(cmd, "sensor init") == 0)
    {
        sensor_init_until_key();
    }
    else if (strcmp(cmd, "i2c scan") == 0)
    {
        if (i2c1_ensure_init() == 0)
        {
            i2c_bus_scan();
        }
    }
    else if (strcmp(cmd, "vl53 test") == 0 || strcmp(cmd, "vl53l0x test") == 0)
    {
        if (i2c1_ensure_init() == 0)
        {
            (void)vl53l0x_read_model_id(1U);
        }
    }
    else if (strcmp(cmd, "sensor deinit") == 0)
    {
        (void)sensor_i2c_deinit();
        printf("I2C1 deinitialized; use \"sensor init\", \"i2c scan\", or \"vl53 test\" to run I2C1_Init() again.\r\n");
    }
    else if (strcmp(cmd, "reset") == 0 || strcmp(cmd, "reboot") == 0)
    {
        /* Software reset over UART: lets a host reset the DUT without an NRST wire,
         * then attach SWD during the boot window (see FLASH_ATTACH_WINDOW_MS). */
        printf("RESET: rebooting via NVIC_SystemReset()\r\n");
        (void)fflush(stdout);
        HAL_Delay(20); /* let the line drain before the core resets */
        NVIC_SystemReset();
    }
    else
    {
        printf("unknown: %s\r\n", cmd);
    }
}

static void print_help(void)
{
    printf("commands:\r\n");
    printf("  help\r\n");
    printf("  status\r\n");
    printf("  rotors on\r\n");
    printf("  rotors off\r\n");
    printf("  monitor i2c   (reads BMP280 every 1s, press any key to stop)\r\n");
    printf("  sensor init   (BMP280 + VL53L0X, 500ms retry; I2C scan once at start; any key stops)\r\n");
    printf("  i2c scan      (HAL_I2C_IsDeviceReady 0x08-0x77, highlights 0x29)\r\n");
    printf("  vl53 test     (read VL53L0X model ID reg 0xC0; alias: vl53l0x test)\r\n");
    printf("  sensor deinit (HAL_I2C_DeInit + clear sensor state; re-init via sensor init / i2c scan / vl53 test)\r\n");
    printf("  reset         (NVIC_SystemReset; software reboot so a host can reset+attach without NRST; alias: reboot)\r\n");
}

static void print_status(void)
{
    GPIO_PinState pc10 = HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_10);
    GPIO_PinState pc11 = HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_11);
    int sensor_ok = (bmp280_read_measurement(&g_sensor.temperature_c, &g_sensor.pressure_pa, &g_sensor.altitude_m) == 0);
    if (sensor_ok)
    {
        g_sensor.read_count++;
    }
    else
    {
        g_sensor.read_fail_count++;
    }

    printf("status:\r\n");
    printf("  pc10=%s\r\n", (pc10 == GPIO_PIN_SET) ? "ON" : "OFF");
    printf("  pc11=%s\r\n", (pc11 == GPIO_PIN_SET) ? "ON" : "OFF");
    printf("  bmp280_detected=%s\r\n", g_sensor.detected ? "yes" : "no");
    if (g_sensor.detected)
    {
        printf("  bmp280_addr=0x%02X\r\n", g_sensor.i2c_addr_7b);
    }
    printf("  sensor_initialized=%s\r\n", g_sensor.initialized ? "yes" : "no");
    printf("  vl53l0x_detected=%s last_model_id=0x%02X\r\n",
           g_vl53.detected ? "yes" : "no",
           g_vl53.last_model_id);
    printf("  vl53l0x_initialized=%s last_range_mm=%u read_count=%lu fail_count=%lu\r\n",
           g_vl53.initialized ? "yes" : "no",
           (unsigned int)g_vl53.last_range_mm,
           (unsigned long)g_vl53.read_count,
           (unsigned long)g_vl53.read_fail_count);
    if (sensor_ok)
    {
        int32_t temp_centi = round_float_to_centi(g_sensor.temperature_c);
        int32_t altitude_centi = round_float_to_centi(g_sensor.altitude_m);
        int32_t pressure_pa_i = round_float_to_int(g_sensor.pressure_pa);
        uint32_t temp_abs_centi = (temp_centi < 0) ? (uint32_t)(-temp_centi) : (uint32_t)temp_centi;
        uint32_t altitude_abs_centi = (altitude_centi < 0) ? (uint32_t)(-altitude_centi) : (uint32_t)altitude_centi;

        printf("  temperature=%s%lu.%02lu C\r\n",
               (temp_centi < 0) ? "-" : "",
               (unsigned long)(temp_abs_centi / 100U),
               (unsigned long)(temp_abs_centi % 100U));
        printf("  pressure=%ld Pa\r\n", (long)pressure_pa_i);
        printf("  altitude=%s%lu.%02lu m\r\n",
               (altitude_centi < 0) ? "-" : "",
               (unsigned long)(altitude_abs_centi / 100U),
               (unsigned long)(altitude_abs_centi % 100U));
    }
    else
    {
        printf("  sensor_read=FAILED\r\n");
    }
    printf("  read_count=%lu fail_count=%lu\r\n",
           (unsigned long)g_sensor.read_count,
           (unsigned long)g_sensor.read_fail_count);
    printf("  rx_byte_count=%lu\r\n", (unsigned long)rx_byte_count);
    printf("  command_count=%lu\r\n", (unsigned long)command_count);
    printf("  tick=%lu ms\r\n", (unsigned long)HAL_GetTick());
}

static void set_rotors(GPIO_PinState state)
{
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10 | GPIO_PIN_11, state);
}

static void monitor_i2c_until_key(void)
{
    uint32_t next_print_ms = HAL_GetTick();
    float last_altitude_m = 0.0f;
    uint8_t have_prev = 0U;

    if (i2c1_ensure_init() != 0)
    {
        printf("monitor aborted: I2C1 init failed\r\n");
        return;
    }
    if (bmp280_probe_and_init(1U) != 0)
    {
        printf("monitor note: BMP280 init failed (reads may fail until sensor responds)\r\n");
    }
    if (vl53l0x_init(1U) != 0)
    {
        printf("monitor note: VL53L0X init failed (will retry during reads)\r\n");
    }
    printf("monitoring BMP280 + VL53L0X every 1 second (press any key to stop)\r\n");
    while (1)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            printf("\r\nmonitor stopped\r\n");
            break;
        }

        uint32_t now = HAL_GetTick();
        if ((int32_t)(now - next_print_ms) >= 0)
        {
            if (bmp280_read_measurement(&g_sensor.temperature_c, &g_sensor.pressure_pa, &g_sensor.altitude_m) == 0)
            {
                g_sensor.read_count++;
                int32_t temp_centi = round_float_to_centi(g_sensor.temperature_c);
                int32_t altitude_centi = round_float_to_centi(g_sensor.altitude_m);
                int32_t pressure_pa_i = round_float_to_int(g_sensor.pressure_pa);
                uint32_t temp_abs_centi = (temp_centi < 0) ? (uint32_t)(-temp_centi) : (uint32_t)temp_centi;
                uint32_t altitude_abs_centi = (altitude_centi < 0) ? (uint32_t)(-altitude_centi) : (uint32_t)altitude_centi;
                const char *trend = "-";
                if (have_prev)
                {
                    if (g_sensor.altitude_m > (last_altitude_m + 0.05f))
                    {
                        trend = "up";
                    }
                    else if (g_sensor.altitude_m < (last_altitude_m - 0.05f))
                    {
                        trend = "down";
                    }
                    else
                    {
                        trend = "flat";
                    }
                }
                printf("tick=%lu ms temp=%s%lu.%02lu C pressure=%ld Pa altitude=%s%lu.%02lu m trend=%s\r\n",
                       (unsigned long)now,
                       (temp_centi < 0) ? "-" : "",
                       (unsigned long)(temp_abs_centi / 100U),
                       (unsigned long)(temp_abs_centi % 100U),
                       (long)pressure_pa_i,
                       (altitude_centi < 0) ? "-" : "",
                       (unsigned long)(altitude_abs_centi / 100U),
                       (unsigned long)(altitude_abs_centi % 100U),
                       trend);
                last_altitude_m = g_sensor.altitude_m;
                have_prev = 1U;
            }
            else
            {
                g_sensor.read_fail_count++;
                printf("tick=%lu ms BMP280 read failed\r\n", (unsigned long)now);
                printf("BMP280 failed -> recovering I2C\r\n");
                i2c_recover();
            }
            uint16_t range_mm = 0U;
            if (vl53l0x_read_range_mm(&range_mm, 0U) == 0)
            {
                g_vl53.read_count++;
                printf("tick=%lu ms VL53L0X range=%u mm\r\n",
                       (unsigned long)now,
                       (unsigned int)range_mm);
            }
            else
            {
                g_vl53.read_fail_count++;
                printf("tick=%lu ms VL53L0X read failed\r\n", (unsigned long)now);
                printf("VL53 failed -> recovering I2C\r\n");
                i2c_recover();
            }
            next_print_ms += 1000U;
        }
    }
}

static void sensor_init_until_key(void)
{
    uint32_t next_init_ms = HAL_GetTick();
    uint32_t init_attempt = 0U;
    uint8_t did_scan = 0U;

    if (i2c1_ensure_init() != 0)
    {
        printf("sensor init aborted: I2C1 init failed\r\n");
        return;
    }
    printf("retrying BMP280 + VL53L0X every 500ms (press any key to stop)\r\n");
    while (1)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            printf("\r\nsensor init retry stopped\r\n");
            break;
        }

        uint32_t now = HAL_GetTick();
        if ((int32_t)(now - next_init_ms) >= 0)
        {
            if (did_scan == 0U)
            {
                did_scan = 1U;
                printf("one-shot I2C scan:\r\n");
                i2c_bus_scan();
            }
            init_attempt++;
            printf("sensor init attempt=%lu\r\n", (unsigned long)init_attempt);
            if (bmp280_probe_and_init(1U) == 0)
            {
                printf("BMP280 init OK (addr=0x%02X)\r\n", g_sensor.i2c_addr_7b);
            }
            else
            {
                printf("BMP280 init FAILED\r\n");
            }
            printf("VL53L0X init:\r\n");
            if (vl53l0x_init(1U) == 0)
            {
                uint16_t range_mm = 0U;
                if (vl53l0x_read_range_mm(&range_mm, 1U) == 0)
                {
                    g_vl53.read_count++;
                    printf("VL53L0X read OK range=%u mm\r\n", (unsigned int)range_mm);
                }
                else
                {
                    g_vl53.read_fail_count++;
                    printf("VL53L0X init OK, read FAILED\r\n");
                    printf("VL53 failed -> recovering I2C\r\n");
                    i2c_recover();
                }
            }
            else
            {
                printf("VL53L0X init FAILED\r\n");
            }
            next_init_ms += 500U;
        }
    }
}

